{
"configFirebase":"Configurar firebase",
"configFirebaseDescription":"Função que configura a instância de projeto do firebase.",
"firebaseApiKey":"Chave da API: Chave de acesso da API. Exemplo: 'AIzaS...FTZ8'",
"firebaseAuthDomain":"Domínio de autenticação: Domínio de autenticação do firebase. Exemplo: 'my-project-11.firebaseapp.com'",
"firebaseDatabaseURL":"URL do banco: URL do banco do firebase. Exemplo: 'my-project-11.firebaseapp.com'",
"firebaseProjectId":"Id do projeto: Id do projeto do firebase. Exemplo: 'my-project-11'",
"firebaseStorageBucket":"Container de armazenamento: Container de armazenamento (storageBucket) do firebase. Exemplo: 'my-project-11.appspot.com'",
"messagingSenderId":"Id de envio das mensagens: Id de envio das mensagens (messagingSenderId) do firebase. Exemplo:'123456789012'",
"firebaseProvider":"Provedor de autenticação: Provedor de autenticação do firebase, caso público, deixar vazio.",
"firebaseUID":"Identificador (uid): Identificador único (uid) do firebase. Exemplo:'ab123s-def2-2131-123d-92dk2l93k2k'",
"firebaseGetDatabase":"Obter banco de dados",
"firebaseGetDatabaseDescription":"Função para obter o banco de dados do firebase",
"firebaseOptionalAppName":"Nome do aplicativo: Nome opcional do aplicativo (caso não seja o aplicativo padrão).",
"firebaseAddData":"Sobrescrever dados",
"firebaseAddDataDescription":"Função que sobrescreve o conteúdo no objeto do firebase. Esta função apagará o conteúdo existente no caminho",
"firebaseDatabase":"Banco de dados: Retorno da função obter bando de dados do firebase",
"firebasePath":"Caminho: Caminho (ou referência) a ser definido no banco de dados do firebase.",
"firebaseData":"Dados: Conteúdo a ser adicionado no caminho.",
"firebaseAddOnEvent":"Evento ao adicionar",
"firebaseAddOnEventDescription":"Função que executa os comandos ao receber alterações do banco de dados firebase no caminho especificado",
"statement":"Comandos:Comandos a serem executados",
"firebaseAddOnnceEvent":"Evento uma vez",
"firebaseAddOnnceEventDescription":"Função que executa os comandos apenas uma vez. Exemplo: ler variáveis de inicialização",
"firebaseUpdateData":"Atualizar dados",
"firebaseUpdateDataDescription":"Função que atualiza os dados de um caminho especificado do bando de dados",
"firebasePushData":"Adicionar dados",
"firebasePushDataDescription":"Função que adiciona um nó dentro e no final do caminho especificado"
}
